{
    "medicines": [
      {
        "id": "1682541234567",
        "nome": "Paracetamol",
        "descricao": "Medicamento analgésico e antipirético utilizado para alívio temporário de dores leves a moderadas e redução da febre.",
        "dosagem": "Adultos e crianças acima de 12 anos: 500-1000mg a cada 4-6 horas, não excedendo 4g por dia.",
        "uso": "Pode ser utilizado para dores de cabeça, dores musculares, dores de dente, dores nas costas, resfriados e febres. Tomar com um copo de água.",
        "efeitosColaterais": "Raramente causa efeitos colaterais quando tomado na dose correta. Em alguns casos pode causar náuseas, vômitos, dor abdominal e reações alérgicas.",
        "contraindicacoes": "Pacientes com doença hepática grave, alcoolismo ou hipersensibilidade ao paracetamol.",
        "categoria": "analgesico",
        "principioAtivo": "Paracetamol (Acetaminofeno)"
      },
      {
        "id": "1682541234568",
        "nome": "Ibuprofeno",
        "descricao": "Anti-inflamatório não esteroidal (AINE) que reduz substâncias no corpo que causam inflamação, dor e febre.",
        "dosagem": "Adultos: 200-400mg a cada 4-6 horas conforme necessário, não excedendo 1200mg em 24 horas.",
        "uso": "Utilizado para alívio de dores de cabeça, dores musculares, artrite, cólicas menstruais, febre e dores associadas a resfriados comuns. Tomar preferencialmente após as refeições.",
        "efeitosColaterais": "Dor de estômago, azia, náuseas, vômitos, diarreia, constipação, gases, tontura, dor de cabeça e erupções cutâneas.",
        "contraindicacoes": "Pacientes com úlcera péptica ativa, histórico de hipersensibilidade ao ibuprofeno, ácido acetilsalicílico ou outros AINEs. Não recomendado no último trimestre da gravidez.",
        "categoria": "anti-inflamatorio",
        "principioAtivo": "Ibuprofeno"
      },
      {
        "id": "1682541234569",
        "nome": "Amoxicilina",
        "descricao": "Antibiótico da classe das penicilinas que combate bactérias no corpo. Eficaz contra uma ampla variedade de infecções bacterianas.",
        "dosagem": "Adultos: 250-500mg três vezes ao dia a cada 8 horas, dependendo da gravidade da infecção.",
        "uso": "Tratamento de infecções bacterianas do trato respiratório, ouvido, nariz, garganta, trato urinário, pele e tecidos moles. Tomar com ou sem alimentos.",
        "efeitosColaterais": "Diarreia, náuseas, vômitos, erupções cutâneas, candidíase e reações alérgicas.",
        "contraindicacoes": "Pacientes com histórico de alergia a penicilinas ou cefalosporinas. Usar com cautela em pacientes com mononucleose infecciosa.",
        "categoria": "antibiotico",
        "principioAtivo": "Amoxicilina"
      },
      {
        "id": "1682541234570",
        "nome": "Dipirona",
        "descricao": "Medicamento analgésico, antipirético e antiespasmódico utilizado para alívio da dor e febre.",
        "dosagem": "Adultos: 500-1000mg até 4 vezes ao dia, com intervalo mínimo de 4 horas entre as doses.",
        "uso": "Indicado para dores intensas de origem diversa, incluindo dor de cabeça, dor de dente, dor pós-operatória e cólicas. Também eficaz para redução da febre.",
        "efeitosColaterais": "Reações alérgicas, queda de pressão arterial, náuseas, boca seca e, em casos raros, agranulocitose (redução de células de defesa no sangue).",
        "contraindicacoes": "Pacientes com alergia a dipirona ou a qualquer componente da fórmula, deficiência de glicose-6-fosfato desidrogenase, porfiria hepática ou granulocitopenia.",
        "categoria": "analgesico",
        "principioAtivo": "Dipirona Sódica"
      },
      {
        "id": "1682541234571",
        "nome": "Omeprazol",
        "descricao": "Medicamento que reduz a produção de ácido no estômago, pertencente à classe dos inibidores da bomba de prótons.",
        "dosagem": "Adultos: 20mg uma vez ao dia, preferencialmente pela manhã, por 4 a 8 semanas.",
        "uso": "Tratamento de úlceras gástricas e duodenais, refluxo gastroesofágico, síndrome de Zollinger-Ellison e prevenção de úlceras em pacientes que usam anti-inflamatórios não esteroidais.",
        "efeitosColaterais": "Dor de cabeça, diarreia, constipação, náuseas, dor abdominal, flatulência e, em uso prolongado, pode causar deficiência de vitamina B12 e magnésio.",
        "contraindicacoes": "Pacientes com hipersensibilidade ao omeprazol ou a qualquer componente da fórmula. Usar com cautela em pacientes com doença hepática grave.",
        "categoria": "outro",
        "principioAtivo": "Omeprazol"
      },
      {
        "id": "1682541234572",
        "nome": "Azitromicina",
        "descricao": "Antibiótico da classe dos macrolídeos que impede o crescimento de bactérias. Eficaz contra infecções respiratórias, de pele e outras.",
        "dosagem": "Adultos: 500mg uma vez ao dia durante 3 dias, ou 500mg no primeiro dia seguido de 250mg por dia nos dias 2 a 5.",
        "uso": "Tratamento de infecções do trato respiratório superior e inferior, infecções de pele e tecidos moles, e algumas doenças sexualmente transmissíveis.",
        "efeitosColaterais": "Diarreia, náuseas, dor abdominal, vômitos e, raramente, alterações na função hepática e reações alérgicas.",
        "contraindicacoes": "Pacientes com hipersensibilidade à azitromicina, eritromicina ou qualquer antibiótico macrolídeo. Usar com cautela em pacientes com problemas hepáticos ou renais.",
        "categoria": "antibiotico",
        "principioAtivo": "Azitromicina"
      },
      {
        "id": "1682541234573",
        "nome": "Diclofenaco",
        "descricao": "Anti-inflamatório não esteroidal (AINE) potente que reduz a inflamação, alivia a dor e diminui a febre.",
        "dosagem": "Adultos: 50mg 2 a 3 vezes ao dia, ou 75mg 2 vezes ao dia, não excedendo 150mg por dia.",
        "uso": "Tratamento de dores reumáticas, musculares, pós-traumáticas, pós-operatórias, cólicas menstruais e outras condições dolorosas e inflamatórias.",
        "efeitosColaterais": "Dor de estômago, azia, náuseas, diarreia, dor de cabeça, tontura, erupções cutâneas e, em casos raros, problemas renais, hepáticos ou cardiovasculares.",
        "contraindicacoes": "Pacientes com úlcera péptica ativa, insuficiência cardíaca grave, doença renal avançada ou histórico de reações alérgicas a AINEs.",
        "categoria": "anti-inflamatorio",
        "principioAtivo": "Diclofenaco Sódico"
      },
      {
        "id": "1682541234574",
        "nome": "Loratadina",
        "descricao": "Anti-histamínico de segunda geração que alivia os sintomas de alergias como coriza, espirros e coceira nos olhos, sem causar sonolência significativa.",
        "dosagem": "Adultos e crianças acima de 12 anos: 10mg uma vez ao dia.",
        "uso": "Alívio temporário dos sintomas de rinite alérgica (febre do feno) e urticária (erupções cutâneas com coceira).",
        "efeitosColaterais": "Boca seca, dor de cabeça, fadiga e, raramente, sonolência.",
        "contraindicacoes": "Pacientes com hipersensibilidade à loratadina ou a qualquer componente da fórmula. Usar com cautela em pacientes com doença hepática.",
        "categoria": "outro",
        "principioAtivo": "Loratadina"
      },
      {
        "id": "1682541234575",
        "nome": "Dexametasona",
        "descricao": "Corticosteroide potente com propriedades anti-inflamatórias e imunossupressoras, usado para tratar várias condições inflamatórias.",
        "dosagem": "Varia conforme a condição: 0,5-10mg por dia, dividido em várias doses ou em dose única.",
        "uso": "Tratamento de condições alérgicas graves, doenças inflamatórias, doenças autoimunes, edema cerebral e como adjuvante em alguns protocolos de quimioterapia.",
        "efeitosColaterais": "Em uso prolongado: aumento de peso, retenção de líquidos, hipertensão, hiperglicemia, maior suscetibilidade a infecções, osteoporose e alterações de humor.",
        "contraindicacoes": "Infecções fúngicas sistêmicas, hipersensibilidade à dexametasona. Usar com cautela em pacientes com diabetes, hipertensão, osteoporose ou úlcera péptica.",
        "categoria": "anti-inflamatorio",
        "principioAtivo": "Dexametasona"
      },
      {
        "id": "1682541234576",
        "nome": "Metformina",
        "descricao": "Medicamento antidiabético oral que reduz a produção de glicose pelo fígado e aumenta a sensibilidade à insulina nos tecidos.",
        "dosagem": "Iniciar com 500mg 1-2 vezes ao dia, podendo aumentar gradualmente até 2000-2500mg por dia, divididos em 2-3 doses.",
        "uso": "Tratamento do diabetes tipo 2, especialmente em pacientes com sobrepeso. Também usado em casos de síndrome dos ovários policísticos e resistência à insulina.",
        "efeitosColaterais": "Distúrbios gastrointestinais como náuseas, vômitos, diarreia, desconforto abdominal e perda de apetite, especialmente no início do tratamento.",
        "contraindicacoes": "Doença renal moderada a grave, acidose metabólica aguda ou crônica, insuficiência cardíaca descompensada e condições hipóxicas.",
        "categoria": "outro",
        "principioAtivo": "Metformina"
      },
      {
        "id": "1682541234577",
        "nome": "Aspirina",
        "descricao": "Anti-inflamatório não esteroidal (AINE) com propriedades analgésicas, antipiréticas e anticoagulantes.",
        "dosagem": "Adultos: 325-650mg a cada 4-6 horas conforme necessário, não excedendo 4g por dia. Para prevenção cardiovascular: 75-325mg uma vez ao dia.",
        "uso": "Alívio de dores leves a moderadas, febre, inflamação. Em doses baixas, é usado para prevenção de eventos cardiovasculares em pacientes de risco.",
        "efeitosColaterais": "Irritação gástrica, náuseas, vômitos, zumbido nos ouvidos e, em casos raros, sangramento gastrointestinal.",
        "contraindicacoes": "Pacientes com úlcera péptica ativa, distúrbios de coagulação, asma induzida por AINEs, crianças com infecções virais (risco de síndrome de Reye).",
        "categoria": "anti-inflamatorio",
        "principioAtivo": "Ácido Acetilsalicílico"
      },
      {
        "id": "1682541234578",
        "nome": "Atenolol",
        "descricao": "Betabloqueador que reduz a frequência cardíaca e a pressão arterial, diminuindo a carga de trabalho do coração.",
        "dosagem": "Adultos: 25-100mg uma vez ao dia.",
        "uso": "Tratamento de hipertensão arterial, angina pectoris, arritmias cardíacas e prevenção secundária após infarto do miocárdio.",
        "efeitosColaterais": "Fadiga, mãos e pés frios, tontura, bradicardia, hipotensão, distúrbios do sono e, raramente, depressão.",
        "contraindicacoes": "Pacientes com insuficiência cardíaca descompensada, choque cardiogênico, bloqueio cardíaco de segundo ou terceiro grau, bradicardia sinusal grave, asma brônquica ou DPOC grave.",
        "categoria": "outro",
        "principioAtivo": "Atenolol"
      },
      {
        "id": "1682541234579",
        "nome": "Fluoxetina",
        "descricao": "Antidepressivo da classe dos inibidores seletivos da recaptação de serotonina (ISRS) que aumenta os níveis de serotonina no cérebro.",
        "dosagem": "Adultos: 20mg uma vez ao dia, pela manhã. A dose pode ser aumentada conforme necessário, até um máximo de 80mg por dia.",
        "uso": "Tratamento de depressão, transtorno obsessivo-compulsivo (TOC), transtorno do pânico, bulimia nervosa e transtorno disfórico pré-menstrual.",
        "efeitosColaterais": "Náuseas, dor de cabeça, insônia, ansiedade, diminuição do apetite, disfunção sexual e, raramente, síndrome serotoninérgica.",
        "contraindicacoes": "Pacientes em uso de inibidores da monoaminoxidase (IMAOs) ou que interromperam o uso há menos de 14 dias, hipersensibilidade à fluoxetina.",
        "categoria": "outro",
        "principioAtivo": "Fluoxetina"
      },
      {
        "id": "1682541234580",
        "nome": "Losartana",
        "descricao": "Antagonista do receptor da angiotensina II que relaxa os vasos sanguíneos, reduzindo a pressão arterial.",
        "dosagem": "Adultos: 25-100mg uma vez ao dia.",
        "uso": "Tratamento de hipertensão arterial, proteção renal em pacientes com diabetes tipo 2 e nefropatia, e redução do risco de AVC em pacientes com hipertensão e hipertrofia ventricular esquerda.",
        "efeitosColaterais": "Tontura, fadiga, diarreia, hipercalemia e, raramente, angioedema.",
        "contraindicacoes": "Pacientes com hipersensibilidade à losartana, gravidez (2º e 3º trimestres) e uso concomitante com alisquireno em pacientes com diabetes ou insuficiência renal.",
        "categoria": "outro",
        "principioAtivo": "Losartana Potássica"
      },
      {
        "id": "1682541234581",
        "nome": "Sinvastatina",
        "descricao": "Medicamento da classe das estatinas que reduz os níveis de colesterol no sangue ao inibir uma enzima chave na produção de colesterol pelo fígado.",
        "dosagem": "Adultos: 5-40mg uma vez ao dia, preferencialmente à noite.",
        "uso": "Redução dos níveis de colesterol LDL e triglicerídeos, aumento do colesterol HDL, e prevenção de doenças cardiovasculares em pacientes de alto risco.",
        "efeitosColaterais": "Dores musculares, fadiga, dor de cabeça, distúrbios gastrointestinais e, raramente, rabdomiólise (destruição das fibras musculares).",
        "contraindicacoes": "Pacientes com doença hepática ativa, gravidez, amamentação e uso concomitante de certos medicamentos que aumentam o risco de rabdomiólise.",
        "categoria": "outro",
        "principioAtivo": "Sinvastatina"
      },
      {
        "id": "1682541234582",
        "nome": "Tramadol",
        "descricao": "Analgésico opioide sintético de ação central que alivia a dor moderada a grave.",
        "dosagem": "Adultos: 50-100mg a cada 4-6 horas conforme necessário, não excedendo 400mg por dia.",
        "uso": "Tratamento de dor moderada a grave, como dor pós-operatória, dor crônica, dor oncológica e dor neuropática.",
        "efeitosColaterais": "Náuseas, vômitos, tontura, sonolência, constipação, boca seca, sudorese e, em casos raros, convulsões e síndrome serotoninérgica.",
        "contraindicacoes": "Pacientes com hipersensibilidade ao tramadol, intoxicação aguda por álcool, hipnóticos, analgésicos de ação central ou psicotrópicos, e pacientes em tratamento com inibidores da MAO.",
        "categoria": "analgesico",
        "principioAtivo": "Cloridrato de Tramadol"
      },
      {
        "id": "1682541234583",
        "nome": "Varfarina",
        "descricao": "Anticoagulante oral que inibe a síntese de fatores de coagulação dependentes da vitamina K, reduzindo a formação de coágulos sanguíneos.",
        "dosagem": "Individualizada com base no INR (Razão Normalizada Internacional). Geralmente inicia-se com 2-5mg uma vez ao dia, ajustando conforme necessário.",
        "uso": "Prevenção e tratamento de trombose venosa profunda, embolia pulmonar, e prevenção de eventos tromboembólicos em pacientes com fibrilação atrial, válvulas cardíacas mecânicas ou após infarto do miocárdio.",
        "efeitosColaterais": "Sangramento (desde leve até grave), náuseas, vômitos, diarreia, dor abdominal e, raramente, necrose cutânea.",
        "contraindicacoes": "Pacientes com sangramento ativo, distúrbios hemorrágicos, hipertensão grave não controlada, endocardite bacteriana, gravidez e procedimentos cirúrgicos recentes.",
        "categoria": "outro",
        "principioAtivo": "Varfarina Sódica"
      },
      {
        "id": "1682541234584",
        "nome": "Levotiroxina",
        "descricao": "Hormônio tireoidiano sintético usado para substituir o hormônio natural quando a tireoide não produz quantidade suficiente.",
        "dosagem": "Adultos: Dose inicial de 25-50mcg por dia, aumentando gradualmente conforme necessário. A dose de manutenção típica é de 100-200mcg por dia.",
        "uso": "Tratamento do hipotireoidismo, bócio atóxico difuso ou nodular, e como terapia adjuvante no tratamento do hipertireoidismo após tireostáticos.",
        "efeitosColaterais": "Em doses excessivas: palpitações, taquicardia, arritmias, tremores, nervosismo, insônia, dor de cabeça, diarreia e perda de peso.",
        "contraindicacoes": "Pacientes com tireotoxicose não tratada, infarto agudo do miocárdio recente, e insuficiência adrenal não corrigida.",
        "categoria": "outro",
        "principioAtivo": "Levotiroxina Sódica"
      },
      {
        "id": "1682541234585",
        "nome": "Clopidogrel",
        "descricao": "Antiagregante plaquetário que inibe a agregação plaquetária e reduz o risco de formação de coágulos sanguíneos.",
        "dosagem": "Adultos: 75mg uma vez ao dia. Em síndromes coronarianas agudas, pode-se iniciar com uma dose de ataque de 300-600mg.",
        "uso": "Prevenção de eventos aterotrombóticos em pacientes com história recente de infarto do miocárdio, AVC isquêmico ou doença arterial periférica estabelecida.",
        "efeitosColaterais": "Sangramento, diarreia, dor abdominal, dispepsia, náuseas e, raramente, púrpura trombocitopênica trombótica.",
        "contraindicacoes": "Pacientes com sangramento patológico ativo, como úlcera péptica ou hemorragia intracraniana, e hipersensibilidade ao clopidogrel.",
        "categoria": "outro",
        "principioAtivo": "Bissulfato de Clopidogrel"
      }
    ]
  }
  